Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: The type of twelve is inferred to be Int, which illustrates the fact that type inference works with opaque types.
ja: twelveの型は、Intであると推論されます、それは型推論が不透明型を扱うという事実を例示します。

source: The type of a Swift array is written in full as Array<Element>, where Element is the type of values the array is allowed to store.
ja: スウィフト配列の型は、完全にはArray<Element>のように書かれます、そこにおいてElementはその配列が格納するのを許される値の型です。

source: The type of a Swift dictionary is written in full as Dictionary<Key, Value>, where Key is the type of value that can be used as a dictionary key, and Value is the type of value that the dictionary stores for those keys.
ja: スウィフトの辞書型は、完全にはDictionary<Key, Value>のように書かれます、ここでKeyは辞書キーとして使われることができる値の型です、そしてValueは辞書がそれらのキーに対してたくわえる値の型です。

source: The type of a Swift set is written as Set<Element>, where Element is the type that the set is allowed to store.
ja: あるスウィフト集合の型は、Set<Element>のように書かれます、そこにおいてElementはその集合が格納することを許される型です。

source: The type of both of these functions is (Int, Int) -> Int.
ja: これらの関数の型は両方とも、(Int, Int) -> Intです。

source: The type of each parameter must be included—it can’t be inferred.
ja: 各パラメータの型は、含められなければなりません ― それは、推論されることができません。

source: The type of the letters variable is inferred to be Set<Character>, from the type of the initializer.
ja: letters変数の型は、そのイニシャライザの型から、Set<Character>と推論されます。

source: The type of the celebrator parameter is Named & Aged, which means “any type that conforms to both the Named and Aged protocols.” It doesn’t matter which specific type is passed to the function, as long as it conforms to both of the required protocols.
ja: celebratorパラメータの型はNamed & Agedです、それは「NamedとAgedプロトコルの両方に準拠する何らかの型」を意味します。どのような具体的な型が関数へ渡されるかは問題ではありません、それが必須プロトコルの両方に準拠する限りは。

source: The type of the numberOfLegs dictionary is inferred to be [String: Int].
ja: numberOfLegs辞書の型は、[String: Int]であると推測されます。

source: The type of the library array is inferred by initializing it with the contents of an array literal.
ja: library配列の型は、ある配列リテラルの内容でそれを初期化することから推論されます。

source: The type of the array is inferred to be [ShoppingListItem].
ja: 配列の型は、[ShoppingListItem]であると推論されます。

source: The type of the parameter to the setter is the same as the return type.
ja: セッターに対するパラメータの型は、return type（戻り型）と同じです。

source: The type of the property must conform to the NSCopying protocol.
ja: プロパティの型は、NSCopyingプロトコルに準拠しなければなりません。

source: The type of the variable or property must be an optional class type.
ja: この変数またはプロパティの型はまた、オプショナルクラス型でなければなりません。

source: The type of these values is specified in the raw-value type and must represent an integer, floating-point number, string, or single character.
ja: これらの値の型は、生の値型において指定されて、整数、浮動小数点数、文字列または単一の文字を表さなければなりません。

source: The type of this function is () -> Void, or “a function that has no parameters, and returns Void.”
ja: この関数の型は() -> Voidです、あるいは「パラメータを持たず、Voidを返す関数」。

source: The type of this property is String?.
ja: このプロパティの型は、String?です。

source: The types of orangesAreOrange and turnipsAreDelicious have been inferred as Bool from the fact that they were initialized with Boolean literal values.
ja: orangesAreOrangeとturnipsAreDeliciousの型は、それらがブールのリテラル値で初期化されたという事実から、Boolとして推論されます。

source: The types used for any raw values or associated values in an enumeration definition must have an access level at least as high as the enumeration’s access level.
ja: 列挙定義の中のあらゆる生の値または関連値のために使われる型は、少なくとも列挙のアクセス水準と同じの高さのアクセス水準を持たなければなりません。

source: The unary minus operator (-) is prepended directly before the value it operates on, without any white space.
ja: 単項マイナス演算子（-）は、それが作用する値の前に、全く空白なしで、直接に先頭に追加されます。

source: The unary minus operator is a prefix operator, and so this method has to be qualified with the prefix modifier.
ja: この単項マイナス演算子は、接頭辞演算子です、なのでこのメソッドはprefix修飾子で修飾されます。

source: The underlying instance remains the same; it is simply treated and accessed as an instance of the type to which it has been cast.
ja: 根底にあるインスタンスは、同じもののままです；それは単に、それがキャストされた型のインスタンスとして扱われ、アクセスされます。

source: The underscore character (_) used in place of a loop variable causes the individual values to be ignored and does not provide access to the current value during each iteration of the loop.
ja: ループ変数の代わりに使われるアンダースコア文字（_）は、その個別の値を無視されるようにして、ループの各繰り返しのときにその現在の値へのアクセスを提供しません。

source: The unused expression is not evaluated.
ja: 使っていない式は、評価されません。

source: The unwrapped value of a forced-value expression can be modified, either by mutating the value itself, or by assigning to one of the value’s members.
ja: 強制された値式のアンラップされた値は、値それ自体を変化させることによって、またはその値のメンバーの１つに代入することによってのどちらでも、修正されることができます。

source: The unwrapped value of an optional-chaining expression can be modified, either by mutating the value itself, or by assigning to one of the value’s members.
ja: オプショナル連鎖のアンラップされた値は、その値自体を変化させることによって、またはその値のメンバーの１つに値に代入することによってのどちらでも修正されることができます。

source: The use of a two-phase initialization process makes initialization safe, while still giving complete flexibility to each class in a class hierarchy.
ja: ２段階初期化処理の使用は初期化を安全にします、その一方でさらに、クラス階層において各クラスに完全な柔軟性を与えます。

source: The use of argument labels can allow a function to be called in an expressive, sentence-like manner, while still providing a function body that is readable and clear in intent.
ja: 引数ラベルの使用は、関数が、表現が豊かな、文章のようなやり方で呼び出されることを可能にします、その一方で、依然として読みやすくて意図が明白な関数本文を提供します。

source: The use of the required modifier ensures that you provide an explicit or inherited implementation of the initializer requirement on all subclasses of the conforming class, such that they also conform to the protocol.
ja: required修飾子の使用は、あなたがある明確なもしくは継承されたイニシャライザ要件の実装を準拠クラスの全てのサブクラス上で、それらもまたそのプロトコルに準拠するように、提供することを確かなものにします。

source: The use of trailing closure syntax in the example above neatly encapsulates the closure’s functionality immediately after the function that closure supports, without needing to wrap the entire closure within the map(_:) method’s outer parentheses.
ja: 上の例での後付クロージャ構文の使用は、クロージャの機能性をクロージャが手助けする関数の直後に手際よく要約していて、クロージャ全体をmap(_:)メソッドの持つ外側の丸括弧の内部に包む必要はありません。

source: The value of john.residence currently contains a valid Residence instance.
ja: john.residenceの値は、現在は有効なResidenceインスタンスを含みます。

source: The value of multiplier is also part of a larger expression later in the string.
ja: multiplierの値は、また、文字列の後半のより大きな式の一部でもあります。

source: The value of opaqueJoinedTriangles in this example is the same as joinedTriangles in the generics example in the The Problem That Opaque Types Solve section earlier in this chapter.
ja: この例でのopaqueJoinedTrianglesの値は、この章の前の不透明型が解決する問題節の総称体の例でのjoinedTrianglesと同じです。

source: The value of a must not be greater than b.
ja: aの値はbより大きくてはいけません。

source: The value of invertedBits is 11110000, which is equal to an unsigned decimal value of 240.
ja: invertedBitsの値は11110000です、それは、符号なし10進の値の240と等しいです。

source: The value of index is set to the first number in the range (1), and the statements inside the loop are executed.
ja: indexの値は、この範囲の最初の数（1）に設定されます、そしてループの内側の文が実行されます。

source: The value of a constant can’t be changed once it’s set, whereas a variable can be set to a different value in the future.
ja: 定数の値は、一旦それが設定されるならば変わることができません、一方で変数は将来異なる値に設定されることができます。

source: The value of a constant doesn’t need to be known at compile time, but you must assign it a value exactly once.
ja: 定数の値はコンパイル時に知られている必要はありません、しかしあなたはそれに値を厳密に一度だけ代入します。

source: The value of a dictionary literal has type [Key: Value], where Key is the type of its key expressions and Value is the type of its value expressions.
ja: 辞書リテラルの値は、型[Key: Value]を持ちます、そこで、Keyはそのキーの式の型です、そして、Valueはその値の式の型です。

source: The value of a selector expression is an instance of the Selector type.
ja: セレクタ式の値は、Selector型のインスタンスです。

source: The value of an array literal has type [T], where T is the type of the expressions inside it.
ja: 配列リテラルの値は型[T]を持ちます、そこで、Tはそれの内部の式の型です。

source: The value of an expression can be inserted into a string literal by placing the expression in parentheses after a backslash (\).
ja: 式の値は、バックスラッシュ（\）の後の丸括弧の中にその式を置くことによってリテラル文字列に差し込まれることができます。

source: The value of any condition in a guard statement must be of type Bool or a type bridged to Bool.
ja: guard文の中のあらゆる条件の値は、Bool型またはBoolにブリッジされる型でなければなりません。

source: The value of any condition in an if statement must be of type Bool or a type bridged to Bool.
ja: if文の中のあらゆる条件の値は、Bool型またはBoolにブリッジされる型でなければなりません。

source: The value of the condition must be of type Bool or a type bridged to Bool.
ja: conditionの値は、Bool型またはBoolにブリッジされる型でなければなりません。

source: The value of the control expression can even be matched to the value of a case in an enumeration and checked for inclusion in a specified range of values.
ja: 制御式の値は、列挙でのケース節の値にさえマッチすることや、指定された範囲の値に包含されるかについて調べさえすることができます。

source: The value of the expression is set to the value obtained by evaluating the value.
ja: 式の値は、値を評価することによって得られる値に設定されます。

source: The value of the expression must have a type that conforms to the Error protocol.
ja: expression（式）の値は、Errorプロトコルに準拠する型を持たなければなりません。

source: The value of these properties cannot be set, and so it is not appropriate to provide a willSet or didSet implementation as part of an override.
ja: これらのプロパティの値は設定されることができません、なのでオーバーライドの一部としてwillSetまたはdidSetの実装を提供することは適切ではありません。

source: The value returned by a type’s hashValue property is not required to be the same across different executions of the same program, or in different programs.
ja: ある型のhashValueプロパティによって返される値は、同じプログラムの、または異なるプログラムでの、異なる実行にまたがって同じであることを要求されません。

source: The value that remains within the bounds of the UInt8 after the overflow addition is 00000000, or zero.
ja: オーバフロー加算の後でUInt8の領域内に残る値は、00000000、またはゼロです。

source: The value used in a subscript can be a named value or a literal.
ja: 添え字の中で使われる値は、名前付きの値またはあるリテラルであることが可能です。

source: The values defined in an enumeration (such as north, south, east, and west) are its enumeration cases.
ja: 列挙で定義される値（例えばnorth、south、east、そしてwest）は、それの列挙ケース節です。

source: The values of finalSquare, board, square, and diceRoll are initialized in the same way as before:
ja: finalSquare、board、square、そしてdiceRollの値は、前と同じように初期化されます：

source: The values of finalSquare, board, square, and diceRoll are initialized in exactly the same way as with a while loop.
ja: finalSquare、board、square、そしてdiceRollの値は、正確にwhileループと同じやり方で初期化されます。

source: The values of a dictionary can be accessed through subscripting by specifying the corresponding key in square brackets: someDictionary["Alex"] refers to the value associated with the key "Alex".
ja: 辞書の値は、角括弧の中に対応するキーを指定することによる添え字指定を通してアクセスされることができます：someDictionary["Alex"]はキー"Alex"と結び付けられた値に言及します。

source: The values of expressions your code can branch on are very flexible.
ja: あなたのコードが分岐することができる式の値は、非常に柔軟です。

source: The values of the conditions specified in a branch statement control how the program branches and, therefore, what block of code is executed.
ja: 分岐文において指定される条件の値は、プログラムがどのように分岐するか、したがって、コードのどのブロックが実行されるかについて制御します。

source: The values of these properties are of the appropriate-sized number type (such as UInt8 in the example above) and can therefore be used in expressions alongside other values of the same type.
ja: これらのプロパティの値は、適切なサイズの数の型（例えば上の例でのUInt8）であり、したがって、式の中で同じ型の他の値と並べて使われることができます。

source: The values passed to a variadic parameter are made available within the function’s body as an array of the appropriate type.
ja: 可変長パラメータに渡される値は、適切な型の配列として、関数の本文内で利用可能にされます。

source: The values that operators affect are operands.
ja: 演算子が影響を及ぼす値は、演算数です。

source: The values within a tuple can be of any type and don’t have to be of the same type as each other.
ja: タプルの内部の値は、どんな型でもかまいません、そして互いに同じ型である必要はありません。

source: The variable unsignedOverflow is initialized with the maximum value a UInt8 can hold (255, or 11111111 in binary).
ja: 変数unsignedOverflowは、UInt8が持つことができる最大限の値で初期化されます（255、または２進数での11111111）。

source: The various aspects of your code that can have access control applied to them (properties, types, functions, and so on) are referred to as “entities” in the sections below, for brevity.
ja: それらに適用可能なアクセス制御を持つあなたのコードのさまざまな面（プロパティ、型、関数、その他）は、簡潔さのために、下記の節において「実在」として言及されます。

source: The version for compiler() is the compiler version, regardless of the Swift version setting passed to the compiler.
ja: compiler()に対するバージョンはコンパイラバージョンです、コンパイラに渡されたSwiftバージョン設定に関係なく。

source: The version for swift() is the language version currently being compiled.
ja: swift()に対するバージョンは、現在コンパイルされている言語バージョンです。

source: The version number for the swift() and compiler() platform conditions consists of a major number, optional minor number, optional patch number, and so on, with a dot (.) separating each part of the version number.
ja: swift()およびcompiler()プラットホーム条件のためのバージョン番号は、メジャー番号、随意のマイナー番号、随意のパッチ番号、その他と、バージョン番号の各部を区切っているドット（.）から成ります。

source: The version of serve(customer:) below performs the same operation but, instead of taking an explicit closure, it takes an autoclosure by marking its parameter’s type with the @autoclosure attribute.
ja: 下のバージョンのserve(customer:)は同じ演算を実行します、しかし明示的なクロージャを取るのではなく、それは自動クロージャを、それのパラメータの型を@autoclosure属性で記することによって取ります。

source: The video mode is assigned a copy of the HD resolution of 1920 by 1080 from before.
ja: ビデオ・モードは、以前にHD解像度1920×1080のコピーを代入されます。

source: The whitespace around an operator is used to determine whether an operator is used as a prefix operator, a postfix operator, or a binary operator.
ja: 演算子のまわりの空白は、演算子が接頭辞演算子か、接尾辞演算子か、または二項演算子として使われるかを決定するために使われます。

source: The whitespace before the closing quotation marks (""") tells Swift what whitespace to ignore before all of the other lines.
ja: 終了引用符（"""）の前の空白文字は、他の行すべての前でどの空白文字を無視するかスウィフトに教えます。

source: The wrapper is responsible for defining and managing any underlying storage needed by its wrapped value.
ja: ラッパーは、それのラップされた値によって必要とされるあらゆる基礎をなすストレージの定義と管理に責任を持ちます。

source: The wrapper must define a wrappedValue instance property.
ja: ラッパーは、あるwrappedValueインスタンスプロパティを定義しなければなりません。

source: The wrapper prevents the value of those properties from being larger than 12, and it sets the projected value to true, to record the fact that it adjusted their values.
ja: ラッパーは、それらプロパティの値が12より大きくなることを防ぎます、そしてそれは予測値をtrueに設定します、それがそれらの値を調節したという事実を記録するために。

source: The write access for an in-out parameter starts after all of the non-in-out parameters have been evaluated and lasts for the entire duration of that function call.
ja: あるin-outパラメータに対する書き込みアクセスは、すべての非in-outパラメータが評価された後に始まって、その関数呼び出しの全期間持続します。

source: The zeros in 0xFF0000 effectively “mask” the second and third bytes of 0xCC6699, causing the 6699 to be ignored and leaving 0xCC0000 as the result.
ja: 0xFF0000のゼロは、0xCC6699の２番目と３番目のバイトを効果的に「マスク」します（隠して消します）、そして6699が無視されるようになって、結果として0xCC0000が残ります。

source: Their durations overlap.
ja: それらの期間が重なる（オーバーラップする）。

source: Their primary role is to ensure that new instances of a type are correctly initialized before they are used for the first time.
ja: それらの主要な役割は、ある型の新しいインスタンスが、それらが初めて使われる前に正しく初期化されることを保証することです。

source: Their return value is of type Double, and can be used within mathematical calculations wherever a Double is accepted:
ja: それらの戻り値はDouble型です、そして数学計算内のDoubleが受け入れられるあらゆるところで使われることができます：

source: Their syntax is similar to both instance method syntax and computed property syntax.
ja: それらの構文は、インスタンスメソッド構文と計算プロパティ構文に似ています。

source: Their type is inferred only at the point that they’re evaluated by the compiler.
ja: それらの型は、それらがコンパイラによって評価される時点においてのみ、推論されます。

source: Then, declare a new variable called currentLoginAttempt, and give it an initial value of 0.”
ja: その後で、currentLoginAttemptと呼ばれる新しい変数を宣言して、それに0の初期値を与える。」

source: There are two levels of optional chaining in use here, to chain through the residence and address properties, both of which are of optional type:
ja: ここで使用されるオプショナル連鎖の２つの階層があります、そしてresidenceとaddressプロパティを通り抜けて繋げます、その両方ともオプショナル型です：

source: There are a number of ways this task can fail, including the file not existing at the specified path, the file not having read permissions, or the file not being encoded in a compatible format.
ja: この作業が失敗するたくさんの道筋があります、そのファイルが指定したパスで存在しない、ファイルが読み出し権限を持っていない、またはファイルが互換性のある形式で符号化されていないことを含めて。

source: There are currently three values on the stack.
ja: 現在は３つの値がこのスタックにはあります。

source: There are four type-casting operators: the is operator, the as operator, the as? operator, and the as! operator.
ja: ４つの型キャスト演算子、is演算子、as演算子、as?演算子、そしてas!演算子があります。

source: There are four ways to handle errors in Swift.
ja: ４つの方法がエラーを取り扱うためにスウィフトにはあります。

source: There are no further superclasses to initialize, and so no further delegation is needed.
ja: 初期化するための更なるスーパークラスはありません、なので、更なる委任は必要ありません。

source: There are now three strong references to this single Person instance.
ja: 現在この１つのPersonインスタンスへの３つの強い参照があります。

source: There are several special forms that allow closures to be written more concisely:
ja: クロージャをより簡潔に書かれるようにする特別ないくつかの形式があります：

source: There are several types of control flow statements in Swift, including loop statements, branch statements, and control transfer statements.
ja: いくつかの種類の制御の流れ文が、スウィフトにあります、それはループ文、分岐文、そして制御移動文を含みます。

source: There are several ways to handle errors.
ja: いくつかの方法がエラーを取り扱うためにはあります。

source: There are three basic forms of an operator declaration, one for each fixity.
ja: 演算子宣言の基本の書式は、各定着性に対して１つずつ、３つあります。

source: There are three characteristics of memory access to consider in the context of conflicting access: whether the access is a read or a write, the duration of the access, and the location in memory being accessed.
ja: アクセス衝突の文脈において考慮すべき３つのメモリアクセスの特徴があります：アクセスが読み出しか書き込みか、アクセスの期間、そしてメモリの中のアクセスされる位置。

source: There are three ways to create an instance of a previously declared structure:
ja: 以前に宣言された構造体のインスタンスを作成するには３つの方法があります：

source: There are two basic forms of an if statement.
ja: if文の２つの基本の書式があります。

source: There are two cases in which a type identifier doesn’t refer to a type with the same name.
ja: ある型識別子がある型に同じ名前で言及しない２つの場合があります。

source: There are two compound types: function types and tuple types.
ja: ２つの複合の型：関数型とタプル型があります。

source: There are two different things named a, the variable in the surrounding scope and the constant in the closure’s scope, but only one variable named b.
ja: aと名前をつけられる２つの異なるものがあります、囲んでいるスコープにおける変数とクロージャのスコープにおける定数、しかしbと名前をつけられる変数はただひとつのものです。

source: There are two kinds of attributes in Swift—those that apply to declarations and those that apply to types.
ja: スウィフトには２種類の属性があります — 宣言に適用されるもの、そして型に適用されるもの。

source: There are two type-casting patterns, the is pattern and the as pattern.
ja: ２つの型キャスト・パターン、isパターンとasパターンがあります。

source: There are two ways to create an instance of a previously declared class:
ja: 以前に宣言されたクラスのインスタンスをつくるには２つの方法があります：

source: There are two ways to implement the == operator: You can implement it yourself, or for many types, you can ask Swift to synthesize an implementation for you.
ja: ==演算子を実装する２つの方法があります：あなたはそれをあなた自身で実装できます、または多くの型に対して、あなたはスウィフトにある実装をあなたかの代わりに実装するよう頼めます。

source: There can only ever be one Bank in the game, and so the Bank is implemented as a class with type properties and methods to store and manage its current state:
ja: １つのBankだけがゲームにおいて存在することができます、なのでBankは型プロパティと型メソッドをもつクラスとして実装されて、その現在の状態を格納および管理します：

source: There is also a new @noescape parameter declaration attribute.
ja: また新しい@noescapeパラメーター宣言属性もあります。

source: There is no requirement for classes to subclass any standard root class, so you can include or omit a superclass as needed.
ja: 何らかの標準となるルートクラスのサブクラスであることは、クラスにとって必要条件ではありません、そのためあなたは必要に応じてスーパークラスを含めたり省略したりすることができます。

source: There is only one loop in the game, and therefore no ambiguity as to which loop the continue statement will affect.
ja: このゲームにはただ１つのループしかありません、それゆえにcontinue文が影響を及ぼすループはどれかについての曖昧さもありません。

source: There must not be whitespace between the comparison operator and the version number.
ja: 比較演算子とバージョン番号の間に空白があってはなりません。

source: There will only ever be one copy of these properties, no matter how many instances of that type you create.
ja: それらのプロパティのコピーはただ１つだけ存在することになります、あなたが作るその型のインスタンスがいくらあろうとも。

source: Thereafter, the game instantiator has the option to set the property to a suitable delegate.
ja: その後は、このゲームのイニシャライザは、このプロパティを適当な委任先に設定する選択肢を持ちます。

source: Therefore, RecipeIngredient automatically inherits all of its superclass’s convenience initializers too.
ja: したがって、RecipeIngredientは自動的にそのスーパークラスの便宜イニシャライザの全てもまた継承します。

source: Therefore, ARC automatically sets a weak reference to nil when the instance that it refers to is deallocated.
ja: したがって、ARCは自動的に、弱い参照をそれが言及するインスタンスが割り当て解除されるときnilに設定します。

source: Therefore, it is sometimes useful to be explicit about which loop or conditional statement you want a break statement to terminate.
ja: したがって、あなたがbreak文に終了して欲しいループまたは条件文はどれかについて明白にすることは、しばしば役に立ちます。

source: Therefore, it’s safe to check for a snake or a ladder as the first action in the loop.
ja: したがって、ループでの最初の活動として、ヘビまたははしごについて調べるのは差し支えありません。

source: Therefore, the names and types of an initializer’s parameters play a particularly important role in identifying which initializer should be called.
ja: したがって、イニシャライザのパラメータの名前と型は、どのイニシャライザが呼ばれなければならないか識別することにおいて特に重要な役割を演じます。

source: Therefore, the overall access level of the compound tuple type is private (the minimum access level of the tuple’s constituent types).
ja: したがって、この複合タプル型の全体としてのアクセス水準は非公開です（このタプルの構成要素の型の内の最小のアクセス水準）。

source: Therefore, when you break the strong references held by the john and unit4A variables, the reference counts do not drop to zero, and the instances are not deallocated by ARC:
ja: したがって、あなたがjohnとunit4A変数によって保持される強い参照を壊すとき、参照総数はゼロに落ちません、なのでインスタンスはARCによって割り当て解除されません：

source: Therefore, you can set it to an instance of any type that adopts the RandomNumberGenerator protocol.
ja: したがって、あなたはそれをRandomNumberGeneratorプロトコルを採用するあらゆる型のインスタンスに設定できます。

source: Therefore, you can simply pass in the greater-than operator, and Swift will infer that you want to use its string-specific implementation:
ja: したがって、あなたはただ単に「大なり」演算子を渡すことができます、そしてスウィフトはあなたがその文字列特有の実装を使いたいのだと推測します：

source: Therefore, you don’t need to specify a custom access level.
ja: したがって、あなたはあつらえのアクセス水準を指定する必要はありません。

source: Therefore, you must write the override modifier before the subclass’s initializer definition.
ja: したがって、あなたはoverride修飾子をそのサブクラスのイニシャライザ定義の前に書かなければなりません。

source: Therefore, your subclass is not (strictly speaking) providing an override of the superclass initializer.
ja: それゆえに、あなたのサブクラスはスーパークラスのイニシャライザのオーバーライドを（厳密に言えば）提供していません。

source: Therefore:
ja: したがって：

source: There’s a write access to oscar during the method call because oscar is the value of self in a mutating method, and there’s a write access to maria for the same duration because maria was passed as an in-out parameter.
ja: oscarへの書き込みアクセスがメソッド呼び出しの間にあります、なぜならoscarは変更メソッドの中のselfの値であるからです、そしてmariaへの書き込みアクセスが同じ期間にあります、なぜならmariaがin-outパラメータとして渡されたからです。

source: There’s actually an even shorter way to write the closure expression above.
ja: さらにより短い方法が上のクロージャ式を書くために実際にあります。

source: There’s an even simpler way to include values in strings: Write the value in parentheses, and write a backslash (\) before the parentheses.
ja: いろいろな値を文字列の中に含めるさらに単純な方法があります：その値を丸括弧の中に書いてください、そして丸括弧の前にバックスラッシュ（\）を書いてください。

source: There’s no need to shift this to the right, as 0x000099 already equals 0x99, which has a decimal value of 153.
ja: 0x000099がすでに0x99に等しいので、これを右へシフトする必要はありません、それは10進の値の153を持ちます。

source: There’s nothing stopping you from having a tuple of type (Int, Int, Int), or (String, Bool), or indeed any other permutation you require.
ja: あなたが(Int, Int, Int)の型のタプル、または(String, Bool)、またはあなたが実際に必要とするあらゆる他の順列を持つのを止めるものは何もありません。

source: There’s one caveat to the rules above.
ja: １つのただし書きが、上の規則にあります。
